Results/mongodb-consistency/load-continuous-fsync_safe-nearest-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
 10 sec: 23680 operations; 2356.69 current ops/sec; [INSERT AverageLatency(us)=19363.8] 
 12 sec: 30000 operations; 2486.23 current ops/sec;   
[OVERALL], RunTime(ms), 12590.0
[OVERALL], Throughput(ops/sec), 2382.8435266084193
[INSERT], Operations, 30000
[INSERT], AverageLatency(us), 11278.8784
[INSERT], MinLatency(us), 335
[INSERT], MaxLatency(us), 574619
[INSERT], Return=0, 29993
[INSERT], 0, 38731.841541755886
[INSERT], 1000, 8442.634508990319
[INSERT], 2000, 6467.598674733506
[INSERT], 3000, 12485.062050699962
[INSERT], 4000, 10195.06655433867
[INSERT], 5000, 12437.228229317852
[INSERT], 6000, 10279.545705415661
[INSERT], 7000, 11757.576606260296
[INSERT], 8000, 12352.07508250825
[INSERT], 9000, 12118.593299571485
[INSERT], 10000, 9658.169886985053
[INSERT], 11000, 9608.107009095773
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2830.3
[CLEANUP], MinLatency(us), 1113
[CLEANUP], MaxLatency(us), 7754
[CLEANUP], 0, 3732.4
[CLEANUP], 1000, 2856.6666666666665
[CLEANUP], 2000, 2459.0
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load