Results/mongodb-consistency/load-continuous-normal-nearest-1.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.45:27018/ycsb-consistency
MongoDB type: Read: primary, Write: safe
 10 sec: 21866 operations; 2179.19 current ops/sec; [INSERT AverageLatency(us)=7661.75] 
 13 sec: 30000 operations; 2533.96 current ops/sec;   
[OVERALL], RunTime(ms), 13243.0
[OVERALL], Throughput(ops/sec), 2265.3477308766896
[INSERT], Operations, 30000
[INSERT], AverageLatency(us), 12112.455933333333
[INSERT], MinLatency(us), 285
[INSERT], MaxLatency(us), 565739
[INSERT], Return=0, 29966
[INSERT], 0, 22739.241916167666
[INSERT], 1000, 7513.108974358975
[INSERT], 2000, 6750.184782608696
[INSERT], 3000, 11257.586666666666
[INSERT], 4000, 12945.764069264069
[INSERT], 5000, 15443.660455486543
[INSERT], 6000, 19729.43073878628
[INSERT], 7000, 11957.861167823601
[INSERT], 8000, 17775.200581395347
[INSERT], 9000, 10812.972107048625
[INSERT], 10000, 14348.038759689922
[INSERT], 11000, 9985.826675470453
[INSERT], 12000, 8273.719626168224
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2666.1
[CLEANUP], MinLatency(us), 1014
[CLEANUP], MaxLatency(us), 6575
[CLEANUP], 0, 2462.375
[CLEANUP], 1000, 2740.181818181818
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb-consistency.conf -P /root/ycsb/config/workload-ycsb-thomas-consistency -P /root/ycsb/config/workload-ycsb-thomas-load -s -load